Repository: GUPY-Team/MyBsnu.Backend
Catalog: src/Shared/Shared.Localization/Resources/Locale.*.resx
Languages: ru_ru, uk_ua

# errors.AudiencesOccupied
source: Audiences: {0} are occupied
ru_ru: Аудитории: {0} заняты
uk_ua: Аудиторії: {0} зайняті

# errors.DeletePublishedSchedule
source: Can't delete a published schedule
ru_ru: Невозможно удалить опубликованное рассписание
uk_ua: Неможливо видалити опублікований розклад

# errors.EnumNotFound
source: Enum member not found
ru_ru: Указан несуществующий член перечисления
uk_ua: Вказаний неіснуючий член перерахування

# errors.GroupsBusy
source: Groups: {0} are busy
ru_ru: Группы {0} уже имеют пару в заданое время
uk_ua: Групи: {0} вже мають пару у цей час

# errors.Internal
source: Internal Server Error
ru_ru: Внутренняя ошибка сервера
uk_ua: Внутрішня помилка на сервері

# errors.InvalidCredentials
source: Invalid password or email
ru_ru: Неверный e-mail или пароль
uk_ua: Невірний емейл або пароль

# errors.NotFound
source: Entity {0} not found
ru_ru: Сущность {0} не найдена
uk_ua: Сутність {0} не знайдена

# errors.SchedulePublished
source: Schedule is already published
ru_ru: Рассписание уже опубликовано
uk_ua: Розклад вже опубліковано

# errors.TeachersBusy
source: Teachers: {0} are busy
ru_ru: Преподаватели: {0} уже ведут пару в заданое время
uk_ua: Викладачі: {0} вже ведуть пару у цей час

# errors.UnableToSignup
source: Unable to signup user: {0}
ru_ru: Незвомжно зарегестрировать пользователя: {0}
uk_ua: Неможливо зареєструвати користувача: {0}

# errors.UnableToCreateUser
source: Unable to create user: {0}
ru_ru: Невозможно создать пользователя: {0}
uk_ua: Неможливо створити користувача: {0}

# errors.UnableToRemoveClaims
source: Unable to remove claims: {0}
ru_ru: Невозможно удалить разрешения: {0}
uk_ua: Неможливо видалити дозволи: {0}

# errors.InvalidClaims
source: Claims {0} are invalid
ru_ru: Разрешения {0} не существуют
uk_ua: Дозволи {0} не існують

# errors.CascadeDeleteRestricted
source: Can't delete: {0}. Deleting entity will cause cascade deletes
ru_ru: Невозможно удалить: {0}. Удаление приведет к каскадным изменениям.
uk_ua: Неможилво видалити: {0}. Видалення призведе до каскадних змін.

# errors.InvalidPagination
source: Invalid values for pagination
ru_ru: Невалидные значения для пейджинации
uk_ua: Невалідні значення для пагінації
